[データサイエンスのためのPython入門19〜DataFrameのその他頻出関数\(pivot\_table, xs\)を解説〜](https://datawokagaku.com/dataframe_func2/)

DataFrame最終回！

In [3]:
import pandas as pd

## `.pivot_table()`でピボットテーブルをつくる

こういうデータがあったとして:

In [4]:
data = {'Date':['Jan-1', 'Jan-1', 'Jan-1', 'Jan-2', 'Jan-2', 'Jan-2'], 
        'User':['Emily', 'John', 'Nick', 'Kevin', 'Emily', 'John'],
        'Method':['Card', 'Card', 'Cash', 'Card', 'Cash', 'Cash'],
        'Price':[100, 250, 200, 460, 200, 130]}
df = pd.DataFrame(data)
df

    Date   User Method  Price
0  Jan-1  Emily   Card    100
1  Jan-1   John   Card    250
2  Jan-1   Nick   Cash    200
3  Jan-2  Kevin   Card    460
4  Jan-2  Emily   Cash    200
5  Jan-2   John   Cash    130

日付とユーザをindexにして、支払手段ごとに使った価格を集計したい。

In [9]:
df.pivot_table(values='Price', index=['Date', 'User'], columns=['Method'])

Method        Card   Cash
Date  User
Jan-1 Emily  100.0    NaN
      John   250.0    NaN
      Nick     NaN  200.0
Jan-2 Emily    NaN  200.0
      John     NaN  130.0
      Kevin  460.0    NaN

今度はUserとMethodを入れ替えてみる。

In [7]:
df.pivot_table(values='Price', index=['Date', 'Method'], columns=['User'])

User          Emily   John  Kevin   Nick
Date  Method
Jan-1 Card    100.0  250.0    NaN    NaN
      Cash      NaN    NaN    NaN  200.0
Jan-2 Card      NaN    NaN  460.0    NaN
      Cash    200.0  130.0    NaN    NaN

集計したいカラムをvaluesに入れて、あとは欲しい情報をindexとcolumnsに入れていくだけ！

## `.xs()`でcross-section操作

`.xs`はcross sectionの略。cross sectionってのは、さっきのピボットテーブルがあったときに、

In [11]:
pivot = df.pivot_table(values='Price', index=['Date', 'Method'], columns=['User'])
pivot

User          Emily   John  Kevin   Nick
Date  Method
Jan-1 Card    100.0  250.0    NaN    NaN
      Cash      NaN    NaN    NaN  200.0
Jan-2 Card      NaN    NaN  460.0    NaN
      Cash    200.0  130.0    NaN    NaN

MethodがCardになってるレコードだけ取りたい！みたいな操作。これがDateがJan-1の行だけ取るなら

In [13]:
pivot.loc['Jan-1']

User    Emily   John  Kevin   Nick
Method
Card    100.0  250.0    NaN    NaN
Cash      NaN    NaN    NaN  200.0

これでいけるのだが、Methodの値でとるなら、こうする。

In [15]:
pivot.xs('Card', level='Method')

User   Emily   John  Kevin  Nick
Date
Jan-1  100.0  250.0    NaN   NaN
Jan-2    NaN    NaN  460.0   NaN